export const countries = [
  { value: "Казахстан", label: "Казахстан" },
  { value: "Германия", label: "Германия" },
];

export const cities = {
  Казахстан: [
    { value: "Алматы", label: "Алматы" },
    { value: "Астана", label: "Астана" },
    { value: "Шымкент", label: "Шымкент" },
    { value: "Караганда", label: "Караганда" },
    { value: "Актобе", label: "Актобе" },
  ],
  Германия: [
    { value: "Берлин", label: "Берлин" },
    { value: "Мюнхен", label: "Мюнхен" },
    { value: "Франкфурт", label: "Франкфурт" },
    { value: "Гамбург", label: "Гамбург" },
    { value: "Кёльн", label: "Кёльн" },
  ],
};

export const recyclingRules = {
  Казахстан: {
    Алматы: {
      plastic: "желтый бак",
      glass: "зеленый бак",
      metal: "синий бак",
      paper: "серый бак",
    },
    Астана: {
      plastic: "желтый бак",
      glass: "зеленый бак",
      metal: "синий бак",
      paper: "серый бак",
    },
    Шымкент: {
      plastic: "желтый бак",
      glass: "зеленый бак",
      metal: "синий бак",
      paper: "серый бак",
    },
    Караганда: {
      plastic: "желтый бак",
      glass: "зеленый бак",
      metal: "синий бак",
      paper: "серый бак",
    },
    Актобе: {
      plastic: "желтый бак",
      glass: "зеленый бак",
      metal: "синий бак",
      paper: "серый бак",
    },
  },
  Германия: {
    Берлин: {
      plastic: "желтый мешок",
      glass: "стеклянный контейнер",
      metal: "желтый мешок",
      paper: "синий мешок",
    },
    Мюнхен: {
      plastic: "желтый мешок",
      glass: "стеклянный контейнер",
      metal: "желтый мешок",
      paper: "синий мешок",
    },
    Франкфурт: {
      plastic: "желтый мешок",
      glass: "стеклянный контейнер",
      metal: "желтый мешок",
      paper: "синий мешок",
    },
    Гамбург: {
      plastic: "желтый мешок",
      glass: "стеклянный контейнер",
      metal: "желтый мешок",
      paper: "синий мешок",
    },
    Кёльн: {
      plastic: "желтый мешок",
      glass: "стеклянный контейнер",
      metal: "желтый мешок",
      paper: "синий мешок",
    },
  },
};